---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.GetVectorSettings
source: html/8282d13b-225b-7499-a8a2-d9c684913389.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.GetVectorSettings Method

Get vector settings object from the style.

## Syntax (C#)
```csharp
public AnalysisDisplayVectorSettings GetVectorSettings()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - vector settings were not created with the object.